L1-MAIN.
    PERFORM L2-INIT.
    PERFORM L2-MAINLINE
        UNTIL MORE-RECS = 'N'.
    PERFORM L2-CLOSING.
    STOP RUN.

L2-INIT.
    OPEN INPUT INPUT.
    OPEN OUTPUT PRTOUT.
    OPEN OUTPUT ERROUT.
    MOVE FUNCTION CURRENT-DATE          TO CURRENT-DATE-AND-TIME.
    MOVE CURRENT-MONTH                  TO ERR-TITLE-MONTH.
    MOVE CURRENT-DAY                    TO ERR-TITLE-DAY.
    MOVE CURRENT-YEAR                   TO ERR-TITLE-YEAR.

    PERFORM L3-INIT-HEADING.
    PERFORM L9-READ-INPUT.

L2-MAINLINE.
    PERFORM L3-VALIDATION
       THRU L3-VALIDATION-EXIT.
    IF ERR-SW = 'N'
       PERFORM L3-MOVE-PRINT
    ELSE
       PERFORM L3-ERROR-PRINT
    END-IF.
    PERFORM L9-READ-INPUT.

L2-CLOSING.
    PERFORM L3-TOTALS.
    PERFORM L3-ERR-TOTALS.
    CLOSE INPUT.
    CLOSE PRTOUT.
    CLOSE ERROUT.

L3-INIT-HEADING.                                                       
    ADD 1                               TO ERR-PAGE-CTR.
    MOVE ERR-PAGE-CTR                   TO ERR-TITLE-PAGE.
    WRITE ERRLINE FROM ERR-TITLE-LINE
        AFTER ADVANCING 1 LINE.
    WRITE ERRLINE FROM ERR-TITLE-LINE2
       AFTER ADVANCING 1 LINE.
    WRITE ERRLINE FROM ERR-COL-HEADING
       AFTER ADVANCING 2 LINES.

L3-VALIDATION.
	MOVE 'N' TO ERR-SW.
	MOVE 'N' TO SITE1-SW.
	MOVE 'N' TO AMNT-SW.
	MOVE 'N' TO LEN-STAY-SW.
	MOVE 'Y' TO FIRST-ERR-SW.
	IF NOT VAL-CAMPGROUND
		MOVE TBL-ERROR(1) TO O-ERR-MSG
		MOVE 'Y' TO ERR-SW
		PERFORM L4-ERROR-PRINT.
	IF I-SITE1 NOT ALPHABETIC
		MOVE TBL-ERROR(2) TO O-ERR-MSG
		MOVE 'Y' TO ERR-SW
		MOVE 'Y' TO SITE1-SW
		PERFORM L4-ERROR-PRINT.
	IF I-SITE2 NUMERIC
		IF I-SITE2 > 0
			NEXT SENTENCE
		ELSE
			MOVE TBL-ERROR(3) TO O-ERR-MSG
			MOVE 'Y' TO ERR-SW
			PERFORM L4-ERROR-PRINT
		END-IF
	ELSE
		MOVE TBL-ERROR(4) TO O-ERR-MSG
		MOVE 'Y' TO ERR-SW
		PERFORM L4-ERROR-PRINT
	END-IF.

***********DATE VALIDATION GOES HERE*************************

*************************************************************
		
	IF I-LEN-STAY NUMERIC
		IF I-LEN-STAY > 1
			IF I-LEN-STAY < 12
				NEXT SENTENCE
			ELSE
				MOVE TBL-ERROR(5) TO O-ERR-MSG
				MOVE 'Y' TO ERR-SW
				PERFORM L4-ERROR-PRINT
			END-IF
		ELSE
			MOVE TBL-ERROR(6) TO O-ERR-MSG
			MOVE 'Y' TO ERR-SW
			PERFORM L4-ERROR-PRINT
		END-IF
	ELSE
		MOVE TBL-ERROR(7) TO O-ERR-MSG
		MOVE 'Y' TO ERR-SW
		MOVE 'Y' TO LEN-STAY-SW
		PERFORM L4-ERROR-PRINT
	END-IF.
	IF I-LNAME = SPACES
		MOVE TBL-ERROR(8) TO O-ERR-MSG
		MOVE 'Y' TO ERR-SW
		PERFORM L4-ERROR-PRINT.
	IF I-FNAME = SPACES
		MOVE TBL-ERROR(9) TO O-ERR-MSG
		MOVE 'Y' TO ERR-SW
		PERFORM L4-ERROR-PRINT.
	IF I-AMT NOT NUMERIC
		MOVE 'Y' TO ERR-SW
		MOVE 'Y' TO AMNT-SW
		MOVE TBL-ERROR(10) TO O-ERR-MSG
		PERFORM L4-ERROR-PRINT.

	IF SITE1-SW = 'N' AND AMNT-SW = 'N' AND LEN-STAY-SW = 'N'
		PERFORM
			VARYING SUB FROM 1 BY 1
				UNTIL I-SITE1 = TBL-SITE(SUB)
        END-PERFORM
		CALCULATE C-AMNT = TBL-SITE-PRICE(SUB) * I-LEN-STAY
			
		IF C-AMT NOT EQUAL I-AMNT
			MOVE 'Y' TO ERR-SW
			MOVE TBL-ERROR(11) TO O-ERR-MSG
			PERFORM L4-ERROR-PRINT
		END-IF
	ELSE
		MOVE 'Y' TO ERR-SW
		MOVE TBL-ERROR(12) TO O-ERR-MSG
		PERFORM L4-ERROR-PRINT
	END-IF.

	IF NOT VAL-CCTYPE
		MOVE 'Y' TO ERR-SW
		MOVE TBL-ERROR(13) TO O-ERR-MSG
		PERFORM L4-ERROR-PRINT.
	IF I-CCNUM NOT NUMERIC
		MOVE 'Y' TO ERR-SW
		MOVE TBL-ERROR(14) TO O-ERR-MSG
		PERFORM L4-ERROR-PRINT.
		
***********DATE VALIDATION GOES HERE*************************

*************************************************************
	
L3-VALIDATION-EXIT.
    EXIT.
	
L3-MOVE-PRINT.
	EVALUATE I-CCTYPE
		WHEN 'V'
			MOVE 'VISA' TO O-CCTYPE
		WHEN 'M'
			MOVE 'MASTER CARD' TO O-CCTYPE
		WHEN 'A'
			MOVE 'AMERICAN EXPRESS' TO O-CCTYPE
	END-EVALUATE.
	
	MOVE I-CAMPGROUND TO O-CAMPGROUND.
	MOVE I-SITE TO O-SITE.
	MOVE I-DATE TO O-DATE.
	MOVE C-END-DATE TO O-END-DATE.
	MOVE I-LEN-STAY TO O-LEN-STAY.
	STRING LAST-NAME DELIMITED BY "  "
		', ' DELIMITED BY SIZE
		FIRST-NAME DELIMITED BY "  "
	INTO O-FULL-NAME.
	MOVE I-AMT TO O-AMT.
	MOVE I-CCNUM TO O-CCNUM.
	MOVE I-CCEXP TO O-CCEXP.

    WRITE PRTLINE FROM DETAIL-LINE
	    AFTER ADVANCING 1 LINE.

L4-ERROR-PRINT.
	IF FIRST-ERR-SW = 'Y'
		MOVE 'N' TO FIRST-ERR-SW
		ADD 1 TO C-REC-ERR-CTR
		MOVE TRAN-REC TO O-ERR
		WRITE ERR-LINE FROM O-ERR-LINE
			AFTER ADVANCING 1 LINE
				AT EOP
					PERFORM L4-ERROR-HEADING
		WRITE ERRLINE FROM O-ERR-MSG-LINE
	ELSE
		WRITE ERRLINE FROM O-ERR-MSG-LINE
			AFTER ADVANCING 1 LINE
				AT EOP
					PERFORM L4-ERROR-HEADING
		ADD 1 TO TOT-ERR-CTR
	END-IF.

L4-ERROR-HEADING.
    ADD 1 TO ERR-PAGE-CTR.
    MOVE ERR-PAGE-CTR TO ERR-TITLE-PAGE.
    WRITE ERRLINE FROM ERR-TITLE-LINE
        AFTER ADVANCING PAGE.
    WRITE ERRLINE FROM ERR-TITLE-LINE2
       AFTER ADVANCING 1 LINE.
    WRITE ERRLINE FROM ERR-COL-HEADING
       AFTER ADVANCING 2 LINES.

L9-READ-INPUT.
    READ INPUT
        AT END
            MOVE 'N' TO MORE-RECS.

END PROGRAM CBLHJB01